IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod
Method of shear calculation

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.NoDefined
not defined

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodVrdcCracked
method according 6.2.2.1

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodVrdcPrestress
method according 6.2.2.2

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodVrdcSimpleHcs
method according 6.2.2.2

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodVrdcGeneralHcs
method according EN1168

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodVrdcPlain
method according 12.6.3

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodVrds
method according 6.2.3.3

IdeaRS.OpenModel.Concrete.CheckResult.ShearMethod.MethodJoints
method according 6.2.5(1)